# BraceParallelLineOffset Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
StructuralSettings..::..BraceParallelLineOffset Property
StructuralSettings Class See Also
---
The distance by which brace symbols in plan views will be offset.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2011
# Syntax
C#
---
```text
public double BraceParallelLineOffset { get; set; }
```

Visual Basic
---
```text
Public Property BraceParallelLineOffset As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double BraceParallelLineOffset {
	double get ();
	void set (double value);
}
```

# Remarks
Applies only when BracePlanRepresentation is set to ParallelLine.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | When setting this property: None of the following disciplines is enabled: Structural. |

# See Also
StructuralSettings Class
Autodesk.Revit.DB.Structure Namespace